Repository: whs/OvzCP
Catalog: po/*/LC_MESSAGES/messages.po
Languages: th

source: Starting %s
th: เปิดเครื่อง %s

source: Stopping %s
th: ปิดเครื่อง %s

source: Destroying %s
th: ทำลาย %s

source: Creating VM
th: สร้าง VM

source: VM not owned by current user
th: ผู้ใช้ปัจจุบันไม่ได้เป็นเจ้าของ VM นี้

source: VM is not running
th: VM ไม่ได้ทำงานอยู่

source: VM is already owned by current user
th: ท่านเป็นเจ้าของ VM นี้อยู่แล้ว

source: %s is under 1,000, please refill.
th: มี %s น้อยกว่า 1,000 กรุณาเติมเพิ่ม

source: VM is running
th: VM กำลังทำงานอยู่

source: You need 5,000 %s to create a VM.
th: คุณจะต้องมี 5,000 %s จึงจะสร้าง VM ได้

source: VM now belongs to you
th: VM กลายเป็นของคุณแล้ว

source: VM ownership removed. Other can now claim this VM
th: ยกเลิกความเป็นเจ้าของ VM แล้ว ผู้ใช้คนอื่นจะสามารถครอบครอง VM นี้ได้

source: VM destroyed
th: ทำลาย VM แล้ว

source: Host OS specification
th: สเปคเครื่องหลัก

source: Terms of Service not accepted
th: ไม่ได้ยอมรับเงื่อนไขในการให้บริการ

source: Invalid template name
th: ชื่อเทมเพลตผิดรูปแบบ

source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: Invalid hostname
th: ชื่อโฮสต์ไม่ถูกต้อง

source: Verification failed. Did you double-submitted the form?
th: ไม่ผ่านการตรวจสอบ ท่านได้ส่งแบบฟอร์มสองครั้งหรือเปล่า?

source: Destroy %s
th: ทำลาย %s

source: VM disk usage exceed allocated amount. You will be billed by amount used instead
th: การใช้งานพื้นที่ดิสก์ของ VM เกินพื้นที่ที่ได้จัดสรรไว้ คุณจะถูกเรียกเก็บเงินตามจำนวนที่ใช้จริงแทน

source: Entry already exists
th: มีรายการอยู่แล้ว

source: You have to wait <span class='time'>%s</span> before you can restart the reverse proxy again
th: คุณต้องรออีก <span class='time'>%s</span> จึงจะสามารถรีสตาร์ท reverse proxy ได้อีกครั้ง

source: Invalid interface
th: อินเทอร์เฟสไม่ถูกต้อง

source: Reverse HTTP proxy is enabled. Please use web forwarding instead
th: เนื่องจากได้เปิดระบบ Reverse HTTP proxy กรุณาใช้ปุ่ม เปิดเว็บ แทน

source: Invalid burst level
th: ระดับการ Burst ไม่ถูกต้อง

source: Settings commited.
th: บันทึกค่าแล้ว

source: No changes.
th: ไม่มีการเปลี่ยนแปลง

source: Root password successfully changed
th: เปลี่ยนรหัสผ่าน root แล้ว

source: Burst level set
th: กำหนดระดับ Burst แล้ว

source: %s information
th: ข้อมูล %s

source: Edit %s
th: แก้ไข %s

source: Billing
th: การเงิน

source: Cannot connect to Munin on the VM.
th: ไม่สามารถเชื่อมต่อหา Munin บน VM

source: Limit not reached. Please wait %s seconds
th: ยังไม่ถึงกำหนดเวลา กรุณารออีก %s วินาที

source: Dashboard
th: แผงควบคุม

source: Host OS
th: ระบบหลัก

source: Cloud Storage
th: พื้นที่บนกลุ่มเมฆ

source: OvzCP provides API for advanced users. You'll need API key to use it. You can have unlimited keys. The API will return in JSON
th: OvzCP มี API สำหรับผู้ใช้งานที่เชี่ยวชาญ โดยท่านจะต้องมี API key ก่อน ซึ่งสามารถขอได้ไม่จำกัด และ API นี้จะคืนค่าเป็น JSON เสมอ

source: Request new key
th: ขอคีย์ใหม่

source: Authentication
th: การยึนยันตน

source: OvzCP API use SHA1-based signing system with nonce. To sign: <ul> <li>Create your request.<br /> <code>/api/info?veid=101</code></li> <li>Add a nonce. Nonce can be a string or an integer that have fewer than 50 letters and digits. Nonce must not be reused or the request would fail. Append it to the request. <br /><code>/api/info?veid=101<strong>&nonce=asdf</strong></code></li> <li>Add the API key.<br /> <code>/api/info?veid=101&nonce=asdf<strong>&apikey=1</strong></code></li> <li>Finally, sign the query string with SHA1 with the API secret appended. <ul> <li>You get this query string: <code>veid=101&nonce=asdf&apikey=1</code></li> <li>Append your API secret. For example if your API secret is abcdef: <code>veid=101&nonce=asdf&apikey=1abcdef</code></li> <li>Sign it with SHA1: <code>eb6ec410cd401e9daa0c380e8934d4befec4a3b1</code></li> <li>Append to the query string: <code>/api/info?veid=101&nonce=asdf&apikey=1<strong>&hash=eb6ec410cd401e9daa0c380e8934d4befec4a3b1</strong></code></li> </ul> </li> </ul> If this seems to be complex to you, you also can use your browser's cookie to login, but it would be less secure.
th: OvzCP API ใช้ระบบการลงนาม SHA1 ที่มีรหัสใช้ครั้งเดียว การลงนามทำดังนี้ <ul> <li>สร้างคำสั่งที่ใช้<br /> <code>/api/info?veid=101</code></li> <li>เติมรหัสใช้ครั้งเดียว ซึ่งเป็นข้อความหรือตัวเลขที่มีความยาวน้อยกว่า 50 ตัวอักษร และใช้ซ้ำไม่ได้ จากนั้นเขียนต่อไปยัง request <code>/api/info?veid=101<strong>&nonce=asdf</strong></code></li> <li>เติม API key<br /> <code>/api/info?veid=101&nonce=asdf<strong>&apikey=1</strong></code></li> <li>และสุดท้าย ต่อท้าย Query string ที่เติม API secret ต่อท้ายแล้ว ด้วยเลข SHA1 <ul> <li>จากขั้นต่อก่อนนี้ จะได้ query string ดังนี้: <code>veid=101&nonce=asdf&apikey=1</code></li> <li>เติม API secret ลงไป เช่นหาก API secret คือ abcdef ให้เติมไปดังนี้: <code>veid=101&nonce=asdf&apikey=1abcdef</code></li> <li>ลง SHA1: <code>eb6ec410cd401e9daa0c380e8934d4befec4a3b1</code></li> <li>เขียนต่อไปยัง query string: <code>/api/info?veid=101&nonce=asdf&apikey=1<strong>&hash=eb6ec410cd401e9daa0c380e8934d4befec4a3b1</strong></code></li> </ul> </li> </ul> หากระบบนี้ซับซ้อน คุณยังสามารถใช้คุกกี้ของ browser เข้าระบบได้แต่จะมีความปลอดภัยน้อยกว่า

source: VM Info
th: ข้อมูล VM

source: <ul> <li><strong>Endpoint:</strong> http://%(endpoint)s</li> <li><strong>Arguments:</strong> <ul> <li><strong>veid</strong>: VEID of the VM to query</li> </ul> </li> <li><strong>Output:</strong><br /> <strong>Online host:</strong> <code>{"uptime": 1900621.8, "meminfo": {"WritebackTmp": 0, "SwapTotal": 0, "SwapFree": 0, "MemFree": 1022709760, "HighTotal": 0, "Committed_AS": 0, "SUnreclaim": 0, "NFS_Unstable": 0, "VmallocChunk": 0, "Writeback": 0, "MemTotal": 2056273920, "VmallocUsed": 0, "HugePages_Free": "0", "HugePages_Rsvd": "0", "AnonPages": 0, "Active": 0, "CommitLimit": 0, "Hugepagesize": 2097152, "Cached": 0, "SwapCached": 0, "LowTotal": 2056273920, "Dirty": 0, "Mapped": 0, "HighFree": 0, "SReclaimable": 0, "VmallocTotal": 0, "HugePages_Surp": "0", "Bounce": 0, "Inactive": 0, "PageTables": 0, "HugePages_Total": "0", "Slab": 0, "Buffers": 0, "LowFree": 1022709760}, "memlimit": [1048576000, 2097152000, 262144000], "ip": "10.0.0.101", "hostname": "online", "running": true, "loadAvg": [0.20999999999999999, 0.089999999999999997, 0.029999999999999999], "nproc": 89, "diskinfo": [100000000, 95331420, 4668580], "os": "gentoo"}</code><br /> <strong>Offline host:</strong> <code>{"uptime": 0, "memlimit": [500000000, 600000000, 600008000], "ip": "10.0.0.106", "hostname": "offline", "running": false, "loadAvg": [0, 0, 0], "diskinfo": [1000000, 609628, 390372], "os": "debian-4.0"}</code> </li> </ul>
th: <ul> <li><strong>ปลายทาง:</strong> http://%(endpoint)s</li> <li><strong>อากิวเมนต์:</strong> <ul> <li><strong>veid</strong>: VEID ของ VM ที่จะเรียกดูข้อมูล</li> </ul> </li> <li><strong>ผลลัพท์:</strong><br /> <strong>เครื่องเปิดอยู่:</strong> <code>{"uptime": 1900621.8, "meminfo": {"WritebackTmp": 0, "SwapTotal": 0, "SwapFree": 0, "MemFree": 1022709760, "HighTotal": 0, "Committed_AS": 0, "SUnreclaim": 0, "NFS_Unstable": 0, "VmallocChunk": 0, "Writeback": 0, "MemTotal": 2056273920, "VmallocUsed": 0, "HugePages_Free": "0", "HugePages_Rsvd": "0", "AnonPages": 0, "Active": 0, "CommitLimit": 0, "Hugepagesize": 2097152, "Cached": 0, "SwapCached": 0, "LowTotal": 2056273920, "Dirty": 0, "Mapped": 0, "HighFree": 0, "SReclaimable": 0, "VmallocTotal": 0, "HugePages_Surp": "0", "Bounce": 0, "Inactive": 0, "PageTables": 0, "HugePages_Total": "0", "Slab": 0, "Buffers": 0, "LowFree": 1022709760}, "memlimit": [1048576000, 2097152000, 262144000], "ip": "10.0.0.101", "hostname": "online", "running": true, "loadAvg": [0.20999999999999999, 0.089999999999999997, 0.029999999999999999], "nproc": 89, "diskinfo": [100000000, 95331420, 4668580], "os": "gentoo"}</code><br /> <strong>เครื่องปิด:</strong> <code>{"uptime": 0, "memlimit": [500000000, 600000000, 600008000], "ip": "10.0.0.106", "hostname": "offline", "running": false, "loadAvg": [0, 0, 0], "diskinfo": [1000000, 609628, 390372], "os": "debian-4.0"}</code> </li> </ul>

source: VM Action
th: คำสั่ง VM

source: <ul> <li><strong>Endpoint:</strong> http://%(endpoint)s</li> <li><strong>Arguments:</strong> <ul> <li><strong>veid</strong>: VEID of the VM</li> <li><strong>action</strong>: One of these: start,stop,restart</li> </ul> </li> <li><strong>Output:</strong> <code>{"result": true}</code> </li> </ul>
th: <ul> <li><strong>ปลายทาง:</strong> http://%(endpoint)s</li> <li><strong>อากิวเมนต์:</strong> <ul> <li><strong>veid</strong>: VEID ของ VM</li> <li><strong>action</strong>: อันใดอันหนึ่ง: start,stop,restart</li> </ul> </li> <li><strong>ผลลัพท์:</strong> <code>{"result": true}</code> </li> </ul>

source: by whsgroup.ath.cx
th: โดย whsgroup.ath.cx

source: Time left until %(unit)s depletion
th: %(unit)s จะหมดภายใน

source: Host Info
th: ข้อมูลระบบหลัก

source: Collapse/Expand
th: ย่อ/ขยาย

source: You have no %(unit)s available!
th: คุณไม่เหลือ %(unit)s แล้ว!

source: day
th: วัน

source: d
th: ว.

source: hour
th: ชั่วโมง

source: h
th: ชม.

source: minute
th: นาที

source: m
th: น.

source: second
th: วินาที

source: s
th: วิ

source: now
th: ขณะนี้

source: Double click to close
th: ดับเบิลคลิกเพื่อปิด

source: Start %(veid)s?
th: เปิดเครื่อง %(veid)s?

source: Stop %(veid)s?
th: ปิดเครื่อง %(veid)s

source: %(unitC)s is required to run a VM. When you run out of %(unit)s every virtual machines will be stopped.
th: ต้องใช้ %(unitC)s ในการรัน VM โดยเมื่อ %(unit)s หมดแล้ว VM ทุกตัวจะหยุดทำงาน

source: If your %(unit)s is under 100 you can't start more VM. %(unitC)s will decrease every minute.
th: ถ้า %(unit)s ของคุณน้อยกว่า 100 คุณจะไม่สามารถเปิด VM เพิ่มได้ โดย %(unitC)s จะลดทุกนาที

source: Click each VM's ID to view detailed cost.
th: คลิกบน ID ของ VM แต่ละตัวเพื่อดูรายละเอียดของค่าใช้จ่าย

source: All calculations are rounded up.
th: การคำนวนทั้งหมดนี้ปัดขึ้น

source: Rate:
th: อัตรา:

source: per
th: ต่อ

source: Cost (%(unit)s)
th: ราคา (%(unit)s)

source: This VM is in burst level %(burst)s
th: VM นี้อยู่ใน Burst ขั้นที่ %(burst)s

source: Total
th: รวม

source: Will deplete in
th: จะหมดภายใน

source: Cloud Storage is a practically unlimited storage. This storage will be replicated to other hosts and it will be served by the host nearest to the user so your site will loads faster. However, cloud storage doesn't have scripting ability.<br /> Cloud storage costs %(price)s %(unit)s per %(per)s MB
th: พื้นที่บนกลุ่มเมฆเป็นพื้นที่เก็บข้อมูลที่เรียกได้ว่าไม่มีจำกัด ข้อมูลในนี้จะถูกคัดลอกไปยังเครื่องอื่นๆ และผู้ใช้งานจะได้รับข้อมูลจากเครื่องที่ใกล้ที่สุด ทำให้เว็บไซต์โหลดไวขึ้น อย่างไรก็ตาม พื้นที่นี้ไม่สามารถรันสคริปต์ประมวลผลต่างๆ ได้ <br /> พื้นที่บนกลุ่มเมฆคิดราคา %(price)s %(unit)s ต่อ %(per)s MB

source: You're using %(used)s of the cloud storage.
th: คุณกำลังใช้งานพื้นที่บนกลุ่มเมฆ %(used)s

source: It'll cost you %(amt)s %(unit)s. This amount will not count into any VM usage price thus the credit depletion date estimation won't count this.
th: เป็นมูลค่า %(amt)s %(unit)s มูลค่านี้จะไม่นับรวมในการใช้งาน VM ดังนั้นข้อมูลประมาณเวลาเครดิตหมดจะไม่คิดในส่วนนี้

source: <b>Endpoint:</b> %(endpoint)s
th: <b>ปลายทาง:</b> %(endpoint)s

source: Get password
th: ขอรหัสผ่าน

source: After you receive your password, click the button again will change your password to a new one. If you happen to lost your old password, it's lost forever.<br />Note that no data would be lost if you reset your password.
th: หลังจากคุณได้รับรหัสผ่านแล้ว การคลิกปุ่มนี้อีกครั้งจะเป็นการเปลี่ยนรหัสผ่าน หากคุณทำรหัสผ่านหายจะไม่สามารถกู้คืนได้ <br/>หมายเหตุ: หากมีการรีเซตรหัสผ่านข้อมูลจะไม่สูญหาย

source: API binding
th: API

source: argument 2 is overwrite, default to false
th: อากิวเมนต์ที่ 2 คือการเขียนทับ ค่าปริยายคือ เท็จ

source: Create new VM
th: สร้าง VM ใหม่

source: Hostname
th: ชื่อโฮสต์

source: OS Template
th: แม่แบบระบบ

source: Owner
th: เจ้าของ

source: Action
th: คำสั่ง

source: Click to show more information of %(veid)s
th: คลิกเพื่อแสดงข้อมูลเพิ่มเติมของ %(veid)s

source: You
th: คุณ

source: Add %(veid)s to your account. No other user can access this VM. You have to pay for this VM. This is <b>IRREVERSIBLE</b>
th: เพิ่ม %(veid)s ไปยังบัญชีของคุณ โดยผู้ใช้คนอื่นจะเข้าใช้ดูไม่ได้ และคุณจะต้องจ่ายเงินในการรัน VM นี้ การกระทำนี้<b>ไม่สามารถย้อนกลับได้</b>

source: Claim
th: ครอบครอง

source: Edit %(veid)s
th: แก้ไข %(veid)s

source: Restart %(veid)s?
th: รีสตาร์ท %(veid)s?

source: Restart %(veid)s
th: รีสตาร์ท %(veid)s

source: Stop %(veid)s
th: ปิดเครื่อง %(veid)s

source: Start %(veid)s
th: เปิดเครื่อง %(veid)s

source: Destroy %(veid)s?
th: ทำลาย %(veid)s?

source: Destroy all data on %(veid)s. Note that there are no backup made and <b>IRREVERSIBLE</b>.
th: ทำลายข้อมูลทั้งหมดบน %(veid)s โดยไม่มีการสำรองข้อมูลและ<b>ยกเลิกไม่ได้</b>

source: (burstable up to %(amt)s MB)
th: (burst ได้ถึง %(amt)s MB)

source: 2: %(amt)s MB memory
th: 2: หน่วยความจำ %(amt)s MB

source: 3: %(amt)s GB disk
th: 3: ดิสก์ %(amt)s GB

source: Create VM
th: สร้าง VM

source: 1: Pick your OS
th: 1: เลือกระบบปฏิบัติการ

source: 2: How much memory
th: 2: หน่วยความจำเท่าใด

source: <b>TIP:</b> Optimum memory
th: <b>คำแนะนำ:</b> หน่วยความจำที่เหมาะสม

source: Kind
th: ชนิด

source: Memory
th: หน่วยความจำ

source: Static website (Plain HTML)
th: เว็บไซต์คงที่ (HTML ธรรมดา)

source: Weblog
th: บล็อค

source: Crowded forum
th: เว็บบอร์ดที่มีผู้ใช้มาก

source: Slide the slider to change.
th: เปลี่ยนโดยลากแถบเลื่อน

source: Minimum is 150MB, maximum is 1000MB<br />Burstable up to %(burst)s%%
th: ขั้นต่ำ 150MB สูงสุด 1000MB<br />Burst ได้ถึง %(burst)s%%

source: 3: How many disk space
th: 3: เนื้อที่ดิสก์เท่าใด

source: <b>TIP:</b> Optimum disk space
th: <b>คำแนะนำ:</b> พื้นที่ดิสก์ที่เหมาะสม

source: Space
th: พื้นที่

source: Minimum is 1GB, maximum is 50GB
th: ขั้นต่ำ 1GB สูงสุด 50GB

source: 4: Final steps
th: 4: ขั้นตอนสุดท้าย

source: Hostname is the name of your machine. This must be unique but have no impact on your machine.
th: โฮสต์เนมคือชื่อเครื่องของท่าน โดยห้ามซ้ำกับเครื่องอื่นแต่ไม่มีผลใดๆ

source: Root is the adminstrator of the system. Root's password is key to the entire system so please use a secure password.<br /> Note that to ssh into the machine, you need to add port 22 forwarding afterward
th: Root คือผู้ดูแลระบบ รหัสผ่านของ root จึงเป็นกุญแจสู่ระบบทั้งหมดดังนั้นกรุณาเลือกรหัสผ่านที่ปลอดภัย<br /> หากจะ ssh เข้าเครื่องนั้นจะต้องเปิดพอร์ต 22 หลังจากเสร็จขั้นตอนเหล่านี้แล้ว

source: Root password
th: รหัสผ่าน root

source: Confirm Root password
th: ยึนยันรหัสผ่าน root

source: This virtual machine will consume %(cost)s %(unit)s per minute. (incl. per VM cost of %(perVM)s %(unit)s)
th: เครื่องเสมือนนี้จะใช้ %(cost)s %(unit)s ต่อนาที (รวมค่า VM %(perVM)s %(unit)s)

source: I accept the terms of services
th: ข้าพเจ้ายอมรับเงื่อนไขในการให้บริการ

source: Check every setting before click on %(create)s
th: ตรวจสอบให้เรียบร้อยก่อน แล้วจึงกดปุ่ม %(create)s

source: Create
th: สร้าง

source: After click "Create", it takes while to create the VM. If your browser display a timeout error page, just hit back twice and refresh the page.
th: หลังจากกดปุ่ม "สร้าง" แล้วจะใช้เวลาครู่หนึ่งในการสร้างเครื่องเสมือน หากเบราว์เซอร์ของคุณแสดงหน้า Timeout กรุณากดปุ่ม back ไปสองครั้งแล้วรีเฟรชหน้านั้น

source: VM List
th: รายการ VM

source: Total VM running cost
th: ค่ารัน VM ทั้งหมด

source: Deplete in
th: จะหมดใน

source: Next cron run in
th: Cron รันครั้งถัดไปใน

source: VM load (5 minutes)
th: โหลดของ VM (5 นาที)

source: Final warning before destroying <u>%(hostname)s</u> (%(veid)s)
th: เตือนครั้งสุดท้ายก่อนจะทำลาย <u>%(hostname)s</u> (%(veid)s)

source: Destroying a virtual machine means that <b>ALL DATA</b> and <b>CONFIGURATION</b> will be removed and cannot be recovered.
th: การทำลายเครื่องเสมือนหมายถึงการลบ<b>ข้อมูลและการตั้งค่าทั้งหมด</b> และไม่สามารถกู้คืนมาได้อีก

source: Make sure to backup ALL data on the %(veid)s before continue
th: โปรดตรวจสอบให้แน่ใจว่าได้สำรองข้อมูลทั้งหมดบน %(veid)s แล้วก่อนดำเนินการต่อ

source: If you changed your mind, click %(back)s
th: ถ้าท่านเปลี่ยนใจ กรุณาคลิก %(back)s

source: back
th: กลับ

source: I understand that this is irreversible, proceed to deletion
th: ข้าพเจ้าเข้าใจว่าการกระทำนี้ย้อนกลับไม่ได้ ให้ดำเนินการต่อไป

source: Please enable JavaScript
th: กรุณาเปิด JavaScript

source: Disk
th: ดิสก์

source: Editing %(veid)s
th: แก้ไข %(veid)s

source: Saving this page will result in VM being restarted
th: การบันทึกหน้านี้จะทำให้ VM ถูกรีสตาร์ท

source: Save
th: บันทึก

source: Web forward
th: เปิดเว็บ

source: Port forward
th: เปิดพอร์ต

source: Restart reverse proxy?
th: รีสตาร์ท reverse proxy?

source: The reverse proxy is being restarted. Please be patience, every sites may not be accesible for few seconds.
th: โปรดรอขณะที่ Reverse proxy กำลังถูกรีสตาร์ท ซึ่งทุกเว็บไซต์อาจจะเข้าไม่ได้สักครู่หนึ่ง

source: Munin monitoring enabled
th: เปิดการเฝ้าระวังด้วย Munin แล้ว

source: Munin monitoring disabled
th: ปิดการเฝ้าระวังด้วย Munin แล้ว

source: Running
th: กำลังทำงาน

source: Stopped
th: หยุด

source: Restart
th: รีสตาร์ท

source: Stop
th: ปิดเครื่อง

source: Start
th: เปิดเครื่อง

source: Destroy
th: ทำลาย

source: Edit
th: แก้ไข

source: Set burst level
th: กำหนดระดับ Burst

source: Forward HTTP application port to port 80 on specified hostname.
th: เปิดพอร์ตของโปรแกรม HTTP ไปยังพอร์ต 80 บนโดเมนที่ระบุ

source: Forward port on an interface
th: เปิดพอร์ตบนเครือข่าย

source: Enable munin monitoring. Note that munin data is public
th: เปิดการเฝ้าระวังด้วย munin โดยข้อมูลนี้จะแสดงเป็นสาธารณะ

source: Disable munin monitoring. Note that munin data is public
th: ปิดการเฝ้าระวังด้วย munin โดยข้อมูลนี้จะแสดงเป็นสาธารณะ

source: Toggle Munin
th: เปิด/ปิด Munin

source: Change root's password
th: เปลี่ยนรหัสผ่านของ root

source: To calculate %(unit)s depletion time for every VM, see <a href="/billing">billing</a>.
th: ในการคำนวนหาเวลา %(unit)s หมดสำหรับทุก VM กรุณาดูที่ <a href="/billing">การเงิน</a>

source: Every VM created must paid this amount.
th: VM ทุกตัวจะต้องจ่ายค่านี้

source: Per VM
th: ราย VM

source: Total times (0.5 x burst level)
th: ราคารวม คูณ (0.5 x ระดับ Burst)

source: level %(burst)s
th: ระดับ %(burst)s

source: %(unit)s will run out in <small>(not counting other VM)</small>
th: %(unit)s จะหมดใน <small>(เมื่อไม่นับ VM ตัวอื่นๆ)</small>

source: Information
th: ข้อมูล

source: Key
th: ชื่อ

source: Value
th: ค่า

source: Internal IP of this VM. Every other VM running in the same machine can access this IP so you have to keep ports secure.
th: IP ภายในของ VM ตัวนี้ โดย VM ตัวอื่นๆ ในเครื่องนี้จะสามารถเข้าถึง IP นี้ได้ ดังนั้นจะต้องรักษาความปลอดภัยของพอร์ตต่างๆ

source: OS template used to create this VM
th: แม่แบบระบบปฏิบัติการที่ใช้สร้าง VM นี้

source: How many space your VM can use. Note that you might able to exceed this capacity temporary.
th: VM นี้ใช้เนื้อที่ได้เท่าไร โดยคุณอาจจะใช้เกินได้ชั่วคราว

source: Disk Capacity
th: ความจุดิสก์

source: How long does this VM have been started
th: ระยะเวลาที่เปิด VM นี้มา

source: Load average
th: โหลดเฉลี่ย

source: 5 minutes
th: 5 นาที

source: 10 minutes
th: 10 นาที

source: 15 minutes
th: 15 นาที

source: The more process, the slower your machine
th: ยิ่งมีโพรเซสมากเครื่องก็ยิ่งช้า

source: Process count
th: จำนวนโพรเซส

source: Monitoring & Graphing
th: การเฝ้าระวังและกราฟ

source: View
th: แสดง

source: How much memory your application may use. If it's full you might still able to run it in burstable memory.
th: โปรแกรมของท่านใช้หน่วยความจำได้มากเท่าใด ถ้าส่วนนี้เต็มโปรแกรมยังอาจจะรันได้ในส่วนของ Burstable

source: Guaranteed
th: การันตี

source: Maximum limit. You application may use these memory but if other VM that haven't reach its guaranteed memory need more memory, your application will be terminated.
th: ขนาดสูงสุด โปรแกรมของท่านอาจจะใช้หน่วยความจำนี้ได้ แต่หากมี VM ที่ต้องการใช้หน่วยความจำและส่วนการันตียังไม่เต็ม โปรแกรมของท่านจะถูกปิดแทน

source: Graph
th: กราฟ

source: Wildcard forwarding will forward anything.yourdomain.com to yourdomain.com.
th: การส่งต่อแบบ Wildcard จะส่งต่อ อะไรก็ได้.ชื่อโดเมน.com ไปยัง ชื่อโดเมน.com

source: After edit changes will <b>NOT</b> be visible until you click %(restartButton)s. (Every site, including this may not be accessible for few seconds) Note that you can restart the proxy once only five minutes.
th: หลังจากคุณทำการแก้ไขแล้วจะยัง<b>ไม่</b>มีผลจนกว่าคุณจะคลิกที่ %(restartButton)s ซึ่งเว็บไซต์ทุกอันบนเครื่องนี้ รวมทั้งหน้านี้อาจจะเข้าไม่ได้ชั่วคราว ท่านสามารถรีสตาร์ทพร็อกซีได้ทุกห้านาทีเท่านั้น

source: restart proxy
th: รีสตาร์ทพร็อกซี่

source: Domain
th: โดเมน

source: Port
th: พอร์ต

source: Delete this item
th: ลบรายการนี้

source: Delete %(hostname)s?
th: ลบ %(hostname)s?

source: Interface
th: อินเทอร์เฟส

source: Internal Port
th: พอร์ตภายใน

source: External Port
th: พอร์ตภายนอก

source: Delete %(iface)s in:%(port)s out:%(outport)s?
th: ลบ %(iface)s ภายใน:%(port)s ภายนอก:%(outport)s?

source: Delete DMZ forwarding to %(iface)s?
th: ลบการส่งต่อแบบ DMZ ไปยัง %(iface)s?

source: To forward every port, type DMZ as External Port. Other fields doesn't need to be filled.
th: ในการส่งต่อทุกพอร์ต พิมพ์ DMZ ในช่องพอร์ตภายนอก ช่องอื่นๆ ไม่จำเป็นต้องกรอก

source: New Root password
th: รหัสผ่าน root ใหม่

source: Burst means that your VM got higher priority in processing. If 2 VMs needs to use the CPU, they will got 50% CPU time each. If one of that VM have burst level 2, it will got 66% CPU time.<br /> Note that if there is only VM using the CPU, it will always receive 100% CPU time.
th: Burst คือการทำให้ VM ของคุณมีความสำคัญมากกว่า VM อื่นๆ โดยหาก VM สองตัวต้องการใช้ CPU จะได้ไปตัวละ 50% แต่ถ้า VM ตัวหนึ่งมี Burst ระดับสอง มันจะได้ 66%<br /> หากว่ามี VM ตัวเดียวใช้งาน CPU จะได้ CPU 100% เสมอ

source: Burst level
th: ระดับ Burst

source: You will be billed for normal amount times (0.5 x burst level). (Eg. a 200 %(unit)s VM with level 5 burst consumes 500 %(unit)s)
th: คุณจะต้องชำระเงินเป็นจำนวนเท่ากับราคาปกติ คูณ 0.5 เท่าของระดับ Burst เช่น VM ที่ใช้ 200 %(unit)s และมี Burst ระดับ 5 จะใช้ 500 %(unit)s

source: Please wait while OvzCP is %(act)s
th: กรุณารอขณะที่ OvzCP กำลัง%(act)s

source: Data
th: ข้อมูล

source: Host operating system
th: ระบบปฏิบัติการหลัก

source: Linux kernel version that currently running on this machine
th: รุ่นของเคอร์เนลลินุกซ์ที่รันอยู่บนเครื่องขณะนี้

source: Kernel Version
th: รุ่นเคอร์เนล

source: How many VM is running currently
th: VM ทำงานอยู่กี่ตัวในขณะนี้

source: VM online
th: VM กำลังทำงาน

source: How long does this machine have been started
th: เครื่องนี้เปิดได้นานเท่าใดแล้ว

source: Total VM cost
th: ราคาค่า VM ทั้งหมด

source: %(unit)s left
th: คงเหลือ %(unit)s

source: Logged in as %(current_user)s
th: เข้าสู่ระบบเป็น %(current_user)s

source: Logout
th: ออกจากระบบ

source: After editing, please use the desktop UI to restart the proxy.
th: หลังจากแก้ไขแล้ว กรุณาใช้เว็บบนคอมพิวเตอร์รีสตาร์ทพร็อกซี่

source: Delete
th: ลบ

source: Add new
th: เพิ่ม

source: Host
th: โฮสต์

source: Off
th: ปิด

source: On
th: เปิด

source: Submit
th: ส่ง

source: VM Port
th: พอร์ทใน VM
